micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_mce.c
  /* Clear flags */
  WRITE_REG(hmce->Instance->IACR, MCE_IACR_IAEF);

#if (USE_HAL_MCE_REGISTER_CALLBACKS == 1)
  if (hmce->MspDeInitCallback == NULL)
  {
    hmce->MspDeInitCallback = HAL_MCE_MspDeInit; /* Legacy weak MspDeInit */
  }

  /* DeInit the low level hardware: CLOCK, NVIC */
  hmce->MspDeInitCallback(hmce);
#else
  /* DeInit the low level hardware: CLOCK, NVIC */
  HAL_MCE_MspDeInit(hmce);
#endif /* USE_HAL_MCE_REGISTER_CALLBACKS */

  /* Change the MCE state */
  hmce->State = HAL_MCE_STATE_RESET;

  /* Reset MCE error status */
  hmce->ErrorCode = HAL_MCE_ERROR_NONE;

  /* Release Lock */
  __HAL_UNLOCK(hmce);

  /* Return function status */
  return HAL_OK;
}


/** *********  main sequence functions : set the configuration of regions, AES context and Noekeon config *********/

/**
  * @brief  Write instance master or fast master keys
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @param  pConfig pointer at an MCE_NoekeonConfig structure that contains
            the configuration on the Noekeon encryption engine
  * @note   Writes are ignored if MKLOCK or GLOCK bit is set in MCE_CR register and HAL error
  *         is reported in that case
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MCE_ConfigNoekeon(MCE_HandleTypeDef *hmce, const MCE_NoekeonConfigTypeDef *pConfig)
{
  HAL_StatusTypeDef ret = HAL_OK;
  uint32_t tickstart;

  /* Check the parameters */
  assert_param(IS_MCE_ALL_INSTANCE(hmce->Instance));

  /* If Key is null, or
     if the global lock is set or
     if the master keys lock is set,
     return an error */
  tickstart = HAL_GetTick();
  if (((hmce->Instance->CR & (MCE_CR_GLOCK | MCE_CR_MKLOCK)) == 0U) && (pConfig->pKey != NULL))
  {
    /* Take Lock */
    __HAL_LOCK(hmce);

    MODIFY_REG(hmce->Instance->CR, MCE_CR_CIPHERSEL, MCE_NOEKEON);
    /* master keys are used for encryption */
    if (pConfig->KeyType == MCE_USE_MASTERKEYS)
    {
      /* If Master Key valid flag is set, need to write dummy value in MKEYRx to reset it */
      if ((hmce->Instance->SR & MCE_SR_MKVALID) != 0U)
      {
        WRITE_REG(hmce->Instance->MKEYR0, 0U);
      }

      /* Set Key */
      WRITE_REG(hmce->Instance->MKEYR0, pConfig->pKey[0]);
      WRITE_REG(hmce->Instance->MKEYR1, pConfig->pKey[1]);
      WRITE_REG(hmce->Instance->MKEYR2, pConfig->pKey[2]);
      WRITE_REG(hmce->Instance->MKEYR3, pConfig->pKey[3]);
      WRITE_REG(hmce->Instance->MKEYR4, pConfig->pKey[4]);
      WRITE_REG(hmce->Instance->MKEYR5, pConfig->pKey[5]);
      WRITE_REG(hmce->Instance->MKEYR6, pConfig->pKey[6]);
      WRITE_REG(hmce->Instance->MKEYR7, pConfig->pKey[7]);
      while (HAL_IS_BIT_CLR(hmce->Instance->SR, MCE_SR_MKVALID))
      {
        /* Check for the Timeout */
        if ((HAL_GetTick() - tickstart) > MCE_TIMEOUT_VALUE)
        {

          hmce->ErrorCode |= HAL_MCE_MASTER_KEY_ERROR;
          ret = HAL_ERROR;
          break;
        }
      }

    }
    else if (pConfig->KeyType == MCE_USE_FASTMASTERKEYS)
    {
      /* If Fast Master Key valid flag is set, need to write dummy value in FMKEYRx to reset it */
      if ((hmce->Instance->SR & MCE_SR_FMKVALID) != 0U)
      {
        WRITE_REG(hmce->Instance->FMKEYR0, 0U);
      }
      /* Set Key */
      WRITE_REG(hmce->Instance->FMKEYR0, pConfig->pKey[0]);
      WRITE_REG(hmce->Instance->FMKEYR1, pConfig->pKey[1]);
      WRITE_REG(hmce->Instance->FMKEYR2, pConfig->pKey[2]);
      WRITE_REG(hmce->Instance->FMKEYR3, pConfig->pKey[3]);
      WRITE_REG(hmce->Instance->FMKEYR4, pConfig->pKey[4]);
      WRITE_REG(hmce->Instance->FMKEYR5, pConfig->pKey[5]);
      WRITE_REG(hmce->Instance->FMKEYR6, pConfig->pKey[6]);
      WRITE_REG(hmce->Instance->FMKEYR7, pConfig->pKey[7]);
      while (HAL_IS_BIT_CLR(hmce->Instance->SR, MCE_SR_FMKVALID))
      {
        /* Check for the Timeout */
        if ((HAL_GetTick() - tickstart) > MCE_TIMEOUT_VALUE)
        {
          hmce->ErrorCode |= HAL_MCE_FASTMASTER_KEY_ERROR;
          ret = HAL_ERROR;
          break;
        }
      }
    }
    else
    {
      /* nothing to do, the keytype is not valid */
    }
    __HAL_UNLOCK(hmce);
  }
  return ret;
}


/**
  * @brief  Set context configuration.
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @param  AESConfig context configuration
  * @param  ContextIndex index of context that is configured
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MCE_ConfigAESContext(MCE_HandleTypeDef *hmce, const MCE_AESConfigTypeDef  *AESConfig,
                                           uint32_t ContextIndex)
{
  HAL_StatusTypeDef ret = HAL_ERROR;
  MCE_Context_TypeDef *p_context;
  uint32_t *p_key;
  __IO uint32_t address;

  /* Check the parameters */
  assert_param(IS_MCE_ALL_INSTANCE(hmce->Instance));
  assert_param(IS_MCE_CONTEXT(hmce->Instance, ContextIndex));


  /* If global lock is set or no configuration provided, context cannot be configured */
  if (((hmce->Instance->CR & MCE_CR_GLOCK) != MCE_CR_GLOCK) && (AESConfig != NULL) && \
      ((ContextIndex == MCE_CONTEXT1) || (ContextIndex == MCE_CONTEXT2)))
  {
    address = (__IO uint32_t)((uint32_t)hmce->Instance + 0x240UL + \
                              (0x30UL * ((ContextIndex - MCE_CONTEXT1) >> MCE_REGCR_CTXID_Pos)));
    p_context = (MCE_Context_TypeDef *)address;
    MODIFY_REG(hmce->Instance->CR, MCE_CR_CIPHERSEL, AESConfig->KeySize);
    /* Check cipher context is not locked */
    if ((p_context->CCCFGR & MCE_CCCFGR_CCLOCK) != MCE_CCCFGR_CCLOCK)
    {
      if ((p_context->CCCFGR & MCE_CCCFGR_KEYLOCK) != MCE_CCCFGR_KEYLOCK)
      {
        /* Take Lock */
        __HAL_LOCK(hmce);

        /* Write nonce */
        WRITE_REG(p_context->CCNR0, AESConfig->Nonce[0]);
        WRITE_REG(p_context->CCNR1, AESConfig->Nonce[1]);

        if (AESConfig->pKey != NULL)
        {
          p_key = AESConfig->pKey;
          WRITE_REG(p_context->CCKEYR0, *p_key);
          p_key++;
          WRITE_REG(p_context->CCKEYR1, *p_key);
          p_key++;
          WRITE_REG(p_context->CCKEYR2, *p_key);
          p_key++;
          WRITE_REG(p_context->CCKEYR3, *p_key);
        }
        /* Compute theoretically expected CRC and compare it with that reported by the peripheral */

