micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_mce.c
}


/**
  * @brief  Enable region.
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @param  RegionIndex index of region that is enabled
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MCE_EnableRegion(MCE_HandleTypeDef *hmce, uint32_t RegionIndex)
{
  HAL_StatusTypeDef ret = HAL_ERROR;
  MCE_Region_TypeDef *p_region;
  __IO uint32_t address;

  /* Check the parameters */
  assert_param(IS_MCE_ALL_INSTANCE(hmce->Instance));
  assert_param(IS_MCE_REGIONINDEX(RegionIndex));

  /* If global lock is set, region cannot be configured */
  if ((hmce->Instance->CR & MCE_CR_GLOCK) != MCE_CR_GLOCK)
  {
    address = (__IO uint32_t)((uint32_t)hmce->Instance + 0x40U + (0x10U * RegionIndex));
    p_region = (MCE_Region_TypeDef *)address;

    /* Take Lock */
    __HAL_LOCK(hmce);

    /* Check region is not enabled, else error */
    if ((p_region->REGCR & MCE_REGCR_BREN) != MCE_REGCR_BREN)
    {
      /* Enable the region */
      SET_BIT(p_region->REGCR, MCE_REGCR_BREN);

      ret = HAL_OK;
    }

    /* Release Lock */
    __HAL_UNLOCK(hmce);
  }

  return ret;

}


/**
  * @brief  Disable region.
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @param  RegionIndex index of region that is disabled
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MCE_DisableRegion(MCE_HandleTypeDef *hmce, uint32_t RegionIndex)
{
  HAL_StatusTypeDef ret = HAL_ERROR;
  MCE_Region_TypeDef *p_region;
  __IO uint32_t address;

  /* Check the parameters */
  assert_param(IS_MCE_ALL_INSTANCE(hmce->Instance));
  assert_param(IS_MCE_REGIONINDEX(RegionIndex));

  address = (__IO uint32_t)((uint32_t)hmce->Instance + 0x40U + (0x10U * RegionIndex));
  p_region = (MCE_Region_TypeDef *)address;

  /* If global lock is set, region cannot be configured */
  if ((hmce->Instance->CR & MCE_CR_GLOCK) != MCE_CR_GLOCK)
  {
    /* Take Lock */
    __HAL_LOCK(hmce);

    /* Check region is enabled, else error */
    if ((p_region->REGCR & MCE_REGCR_BREN) == MCE_REGCR_BREN)
    {
      /* Disable the region */
      CLEAR_BIT(p_region->REGCR, MCE_REGCR_BREN);

      ret = HAL_OK;
    }

    /* Release Lock */
    __HAL_UNLOCK(hmce);
  }

  return ret;

}


/** *************  Lock functions : Lock AES and Noekeon configurations and keys *********/

/**
  * @brief  Lock MCE instance registers configuration
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @note   Once MCE_CR_GLOCK is set, all writes to MCE registers are ignored,
  *         with the exception of MCE_IACR and MCE_IAIER registers.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MCE_LockGlobalConfig(MCE_HandleTypeDef *hmce)
{
  /* Check the parameters */
  assert_param(IS_MCE_ALL_INSTANCE(hmce->Instance));

  /* Take Lock */
  __HAL_LOCK(hmce);

  SET_BIT(hmce->Instance->CR, MCE_CR_GLOCK);

  /* Release Lock */
  __HAL_UNLOCK(hmce);

  return HAL_OK;

}

/**
  * @brief  Lock cipher context
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @param  ContextIndex index of context that is locked
  * @note   Once MCE_CCCFGR_CCLOCK is set, writes to MCE_CCxCFGR and MCE_CCxNR registers
  *         are ignored until next MCE reset.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MCE_LockAESContextConfig(MCE_HandleTypeDef *hmce, uint32_t ContextIndex)
{
  HAL_StatusTypeDef ret = HAL_ERROR;
  MCE_Context_TypeDef *p_context;
  __IO uint32_t address;

  /* Check the parameters */
  assert_param(IS_MCE_ALL_INSTANCE(hmce->Instance));
  assert_param(IS_MCE_CONTEXT(hmce->Instance, ContextIndex));

  /* If global lock is set or no configuration provided, context cannot be configured */
  if (((hmce->Instance->CR & MCE_CR_GLOCK) != MCE_CR_GLOCK) && \
      ((ContextIndex == MCE_CONTEXT1) || (ContextIndex == MCE_CONTEXT2)))
  {
    address = (__IO uint32_t)((uint32_t)hmce->Instance + 0x240UL + \
                              (0x30UL * ((ContextIndex - MCE_CONTEXT1) >> MCE_REGCR_CTXID_Pos)));
    p_context = (MCE_Context_TypeDef *)address;

    /* Take Lock */
    __HAL_LOCK(hmce);

    SET_BIT(p_context->CCCFGR, MCE_CCCFGR_CCLOCK);

    ret = HAL_OK;

    /* Release Lock */
    __HAL_UNLOCK(hmce);
  }

  return ret;

}

/**
  * @brief  Lock context cipher key
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @param  ContextIndex index of context the cipher key of which is locked
  * @note   Once MCE_CCCFGR_KEYLOCK is set, writes to MCE_CCxKEYR registers are ignored
  *         until next MCE reset. KEYCRC bitfield value does not change.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MCE_LockAESContextKey(MCE_HandleTypeDef *hmce, uint32_t ContextIndex)
{
  HAL_StatusTypeDef ret = HAL_ERROR;
  MCE_Context_TypeDef *p_context;
  __IO uint32_t address;

  /* Check the parameters */
  assert_param(IS_MCE_ALL_INSTANCE(hmce->Instance));
  assert_param(IS_MCE_CONTEXT(hmce->Instance, ContextIndex));

  /* If global lock is set or no configuration provided, context cannot be configured */
  if (((hmce->Instance->CR & MCE_CR_GLOCK) != MCE_CR_GLOCK) && \
      ((ContextIndex == MCE_CONTEXT1) || (ContextIndex == MCE_CONTEXT2)))
  {
    address = (__IO uint32_t)((uint32_t)hmce->Instance + 0x240UL + \
                              (0x30UL * ((ContextIndex - MCE_CONTEXT1) >> MCE_REGCR_CTXID_Pos)));
    p_context = (MCE_Context_TypeDef *)address;

    /* Take Lock */
    __HAL_LOCK(hmce);

    SET_BIT(p_context->CCCFGR, MCE_CCCFGR_KEYLOCK);

    ret = HAL_OK;

    /* Release Lock */
    __HAL_UNLOCK(hmce);
  }

  return ret;

}

/**
  * @brief  Lock Noekeon master keys
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @note   Once MCE_CR_MKLOCK is set, writes to MCE_MKEYRx and MCE_FMKEYRx registers are ignored until next MCE reset.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MCE_LockNoekeonMasterKeys(MCE_HandleTypeDef *hmce)
{
  HAL_StatusTypeDef ret = HAL_ERROR;

  /* Check the parameters */
  assert_param(IS_MCE_ALL_INSTANCE(hmce->Instance));

