micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_mce.c
  /* If global lock is set, master keys lock cannot be set */
  if ((hmce->Instance->CR & MCE_CR_GLOCK) != MCE_CR_GLOCK)
  {
    /* Take Lock */
    __HAL_LOCK(hmce);

    SET_BIT(hmce->Instance->CR, MCE_CR_MKLOCK);

    ret = HAL_OK;

    /* Release Lock */
    __HAL_UNLOCK(hmce);
  }

  return ret;

}


/**
  * @brief  Initialize the MCE MSP.
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @retval None
  */
__weak void HAL_MCE_MspInit(MCE_HandleTypeDef *hmce)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hmce);

  /* NOTE : This function should not be modified; when the callback is needed,
            the HAL_MCE_MspInit can be implemented in the user file.
   */
}

/**
  * @brief  DeInitialize MCE MSP.
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @retval None
  */
__weak void HAL_MCE_MspDeInit(MCE_HandleTypeDef *hmce)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hmce);

  /* NOTE : This function should not be modified; when the callback is needed,
            the HAL_MCE_MspDeInit can be implemented in the user file.
   */
}

/**
  * @brief  get the CRC key of the specified context.
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @param  pCRCKey pointer to the CRC key
  * @param  ContextIndex index of CONTEXT the CRC key
  * @retval HAL status
  */

HAL_StatusTypeDef HAL_MCE_GetAESContextCRCKey(const MCE_HandleTypeDef *hmce, uint32_t *pCRCKey, uint32_t ContextIndex)
{
  HAL_StatusTypeDef ret = HAL_OK;
  const MCE_Context_TypeDef *p_context;
  __IO uint32_t address;

  /* Check the parameters */
  assert_param(IS_MCE_AES_INSTANCE(hmce->Instance));
  assert_param(IS_MCE_CONTEXT(hmce->Instance, ContextIndex));

  if (*pCRCKey == 0x00U)
  {
    ret = HAL_ERROR;
  }

  address = (__IO uint32_t)((uint32_t)hmce->Instance + 0x240UL + \
                            (0x30UL * ((ContextIndex - MCE_CONTEXT1) >> MCE_REGCR_CTXID_Pos)));
  p_context = (MCE_Context_TypeDef *)address;

  *pCRCKey = READ_REG((p_context->CCCFGR)) & MCE_CCCFGR_KEYCRC;

  *pCRCKey >>= MCE_CCCFGR_KEYCRC_Pos;
  return ret;
}

/**
  * @brief  Compute Key CRC
  * @param  pKey pointer at set of keys
  * @retval CRC value
  */
uint32_t HAL_MCE_KeyCRCComputation(const uint32_t *pKey)
{
  uint8_t crc7_poly = 0x7;
  const uint32_t key_strobe[4] = {0xAA55AA55U, 0x3U, 0x18U, 0xC0U};
  uint8_t  i;
  uint8_t crc = 0;
  uint32_t  j;
  uint32_t  keyval;
  uint32_t k;
  const uint32_t *temp = pKey;

  for (j = 0U; j < 4U; j++)
  {
    keyval = *temp;
    temp++;
    if (j == 0U)
    {
      keyval ^= key_strobe[0];
    }
    else
    {
      keyval ^= (key_strobe[j] << 24) | ((uint32_t)crc << 16) | (key_strobe[j] << 8) | crc;
    }

    crc = 0;
    for (i = 0; i < (uint8_t)32; i++)
    {
      k = ((((uint32_t)crc >> 7) ^ ((keyval >> ((uint8_t)31 - i)) & ((uint8_t)0xF)))) & 1U;
      crc <<= 1;
      if (k != 0U)
      {
        crc ^= crc7_poly;
      }
    }

    crc ^= (uint8_t)0x55;
  }

  return (uint32_t) crc;
}

/**
  * @brief  Handle MCE interrupt request.
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @retval None
  */
void HAL_MCE_IRQHandler(MCE_HandleTypeDef *hmce)
{
  uint32_t isr_reg;

  isr_reg = READ_REG(hmce->Instance->IASR);
  if ((isr_reg & MCE_IASR_IAEF) == MCE_IASR_IAEF)
  {
    /* Set configuration access error */
    hmce->ErrorCode |= HAL_MCE_CONFIGURATION_ACCESS_ERROR;

    /* Clear configuration access error flag */
    WRITE_REG(hmce->Instance->IACR, MCE_IACR_IAEF);
  }

#if (USE_HAL_MCE_REGISTER_CALLBACKS == 1)
  hmce->ErrorCallback(hmce);
#else
  HAL_MCE_ErrorCallback(hmce);
#endif /* USE_HAL_MCE_REGISTER_CALLBACKS */
}

/**
  * @brief MCE error callback.
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @retval None
  */
__weak void HAL_MCE_ErrorCallback(MCE_HandleTypeDef *hmce)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hmce);

  /* NOTE : This function should not be modified; when the callback is needed,
            the HAL_MCE_ErrorCallback can be implemented in the user file.
   */
}

/**
  * @brief  Return the MCE state.
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @retval HAL status
  */
HAL_MCE_StateTypeDef HAL_MCE_GetState(MCE_HandleTypeDef const *hmce)
{
  /* Check the parameters */
  assert_param(IS_MCE_ALL_INSTANCE(hmce->Instance));

  return hmce->State;
}

/**
  * @brief  Return the MCE error code.
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @retval MCE error code (bitfield on 32 bits)
  */
uint32_t HAL_MCE_GetError(MCE_HandleTypeDef const *hmce)
{
  /* Check the parameters */
  assert_param(IS_MCE_ALL_INSTANCE(hmce->Instance));

  return hmce->ErrorCode;
}


/**
  * @}
  */

/**
  * @}
  */

#endif /* MCE1 */

#endif /* HAL_MCE_MODULE_ENABLED */


/**
  * @}
  */

/**
  * @}
  */
